//Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.

let i = 1
while (i <= 10) {
	console.log(i)
	i += 1
}
console.log('------------------------------------------------')
//Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.

for (let i = 2; i <= 20; i++) {
	if (i % 2 !== 0) {
		continue
	}
	console.log(i)
}
console.log('------------------------------------------------')
//Вивести в консоль таблицю множення числа 7 за допомогою циклу for.
for (let i = 1; i <= 10; i++) {
	console.log(`7 * ${i} = ${7 * i}`)
}
console.log('------------------------------------------------')
//Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
let n = 5
for (let i = 1; i < 20; i++) {
	if (i >= n) {
		break
	}
	console.log(i)
}
console.log('------------------------------------------------')
//За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.
let index = 1
while (index <= 20) {
	if (index % 3 === 0) {
		index++
		continue
	}
	console.log(index)
	index++
}
